# GetAllSpecs Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecUtils..::..GetAllSpecs Method
SpecUtils Class See Also
---
Gets the identifiers of all specs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static IList<ForgeTypeId> GetAllSpecs()
```

Visual Basic
---
```text
Public Shared Function GetAllSpecs As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
static IList<ForgeTypeId^>^ GetAllSpecs()
```

# ### Return Value
The spec identifiers.
# See Also
SpecUtils Class
Autodesk.Revit.DB Namespace